#LIMPIEA Y TRANSFORMACION DE DATOS

In [8]:
## importal libreria 

import pandas as pd
import numpy as np
import matplotlib.pyplot as  plt

importar archivo

In [46]:
salaries = pd.read_csv("./data st/linkedin-jobs-usa.csv")

In [47]:
salaries.head()

,title,company,description,onsite_remote,salary,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,NaN,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,NaN,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...

tratamiento de duplicado

In [13]:
salaries.drop_duplicates()

,title,company,description,onsite_remote,salary_float,location,criteria,posted_date,link
0,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,86658.0,Buffalo-Niagara Falls Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
1,Data Analyst - Recent Graduate,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,74052.0,"San Jose, CA","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-22,https://www.linkedin.com/jobs/view/data-analys...
2,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,81425.0,"Texas, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
3,Data Analyst,PayPal,"At PayPal (NASDAQ: PYPL), we believe that ever...",onsite,74828.0,"Illinois, United States","[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
4,Entry-Level Data Analyst,The Federal Savings Bank,"The Federal Savings Bank, a national bank and ...",onsite,83737.0,"Chicago, IL","[{'Seniority level': 'Entry level'}, {'Employm...",2022-11-17,https://www.linkedin.com/jobs/view/entry-level...
...,...,...,...,...,...,...,...,...,...
2840,Junior Data Analyst,Iris Software Inc.,"Iris's client, one of the world's largest fina...",hybrid,93219.5,"Texas, United States","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-21,https://www.linkedin.com/jobs/view/junior-data...
2841,Data Analyst (SQL),Marwood Group,The Marwood Group (Marwood) is a leading healt...,hybrid,85000.0,New York City Metropolitan Area,"[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-10-26,https://www.linkedin.com/jobs/view/data-analys...
2842,Data Analyst,SmartSense by Digi,"Join a high-performing, tight-knit team at a f...",hybrid,76407.5,"Mishawaka, IN","[{'Seniority level': 'Associate'}, {'Employmen...",2022-11-17,https://www.linkedin.com/jobs/view/data-analys...
2843,Data Analyst,Synergy Search,Nashville (Berry Hill) based company looking t...,hybrid,90000.0,Nashville Metropolitan Area,"[{'Seniority level': 'Not Applicable'}, {'Empl...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...
2844,Data Analyst,Insight Global,Overview - Minimum 5 years in a quantitative d...,hybrid,140000.0,"Burbank, CA","[{'Seniority level': 'Mid-Senior level'}, {'Em...",2022-11-14,https://www.linkedin.com/jobs/view/data-analys...

In [14]:
salaries_limpieza = salaries.copy()

In [48]:
salaries_limpieza.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2840    False
2841    False
2842    False
2843    False
2844    False
Length: 2845, dtype: bool

In [49]:
salaries_limpieza.duplicated().count()

np.int64(2845)

In [50]:
salaries_limpieza[salaries_limpieza.duplicated]

Empty DataFrame
Columns: [title, company, description, onsite_remote, salary_float, location, criteria, posted_date, link]
Index: []

In [19]:
salaries_limpieza = salaries_limpieza.drop_duplicates()

Tratamiento de vcalores nulos

## tratamientos 
visualizar los valores nulos valores nulos

In [51]:
print(f"valores NaN por columnas ){salaries_limpieza.isnull().sum()}")

valores NaN por columnas )title            0
company          0
description      0
onsite_remote    0
salary_float     0
location         0
criteria         0
posted_date      0
link             0
dtype: int64

In [52]:
salaries_limpieza.isna()

,title,company,description,onsite_remote,salary_float,location,criteria,posted_date,link
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
2840,False,False,False,False,False,False,False,False,False
2841,False,False,False,False,False,False,False,False,False
2842,False,False,False,False,False,False,False,False,False
2843,False,False,False,False,False,False,False,False,False
2844,False,False,False,False,False,False,False,False,False

In [53]:
print(f"valores NaN por columnas ){salaries_limpieza.isnull()}")

valores NaN por columnas )      title  company  description  onsite_remote  salary_float  location  \
0     False    False        False          False         False     False
1     False    False        False          False         False     False
2     False    False        False          False         False     False
3     False    False        False          False         False     False
4     False    False        False          False         False     False
...     ...      ...          ...            ...           ...       ...
2840  False    False        False          False         False     False
2841  False    False        False          False         False     False
2842  False    False        False          False         False     False
2843  False    False        False          False         False     False
2844  False    False        False          False         False     False

      criteria  posted_date   link
0        False        False  False
1        False        False  False
2        False        False  False
3        False        False  False
4        False        False  False
...        ...          ...    ...
2840     False        False  False
2841     False        False  False
2842     False        False  False
2843     False        False  False
2844     False        False  False

[2845 rows x 9 columns]

In [23]:
print(f"valores NaN por columnas ){salaries_limpieza.isna().sum()}")

valores NaN por columnas )title            0
company          0
description      0
onsite_remote    0
salary_float     0
location         0
criteria         0
posted_date      0
link             0
dtype: int64

In [ ]:
df_sin_nulos = salaries.dropna()
#ELIMIA los datos eliminsa la fila y podemos perder los datos importantes

In [27]:
df_sin_nulos.shape

(2845, 9)

In [54]:
##elina las columnas que tienen al menos un valor nul
df_sin_nulos_columnas =salaries.dropna(axis=1)

In [55]:
df_sin_nulos.isna().sum()

title            0
company          0
description      0
onsite_remote    0
salary_float     0
location         0
criteria         0
posted_date      0
link             0
dtype: int64

In [30]:
df_sin_nulos.shape

(2845, 9)

In [35]:
df_sin_nulos['salary'].head()

KeyError: 'salary'

In [41]:
df_sin_nulos = salaries_limpieza.dropna(axis=0,how='any')
df_sin_nulos = salaries_limpieza.dropna(axis=0,how='all')

In [56]:
df_sin_nulos = salaries_limpieza.dropna(axis=1,how='any')
df_sin_nulos = salaries_limpieza.dropna(axis=1,how='all')

In [57]:
salaries_limpieza.shape

(2845, 9)

 axia 0 rervisa por fila 
 axia 1 revisa por columna

- Any: Elimina si exisrte por lo menos 1 NaN

- All:si todos son NaN

PASING O PARSEO nos ayuda remplazar

In [59]:
 df_sin_nulos ['salary']

KeyError: 'salary'

In [1]:
## Este código toma una columna 'salary' que contiene valores de salario en formato de cadena, 
## elimina cualquier caracter no numérico, extrae los dígitos y convierte la columna resultante en valores numéricos de tipo float. 
##El resultado se almacena en una nueva columna llamada 'salary_numeric'. 
##Esto es útil cuando la columna 'salary' inicial contiene caracteres no numéricos y se desea trabajar con los salarios como valores numéricos.
df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

<>:5: SyntaxWarning: invalid escape sequence '\d'
<>:5: SyntaxWarning: invalid escape sequence '\d'
<>:5: SyntaxWarning: invalid escape sequence '\d'
<>:5: SyntaxWarning: invalid escape sequence '\d'
C:\Users\lizet\AppData\Local\Temp\ipykernel_16760\1376782534.py:5: SyntaxWarning: invalid escape sequence '\d'
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\lizet\AppData\Local\Temp\ipykernel_16760\1376782534.py:5: SyntaxWarning: invalid escape sequence '\d'
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\lizet\AppData\Local\Temp\ipykernel_16760\1376782534.py:5: SyntaxWarning: invalid escape sequence '\d'
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)
C:\Users\lizet\AppData\Local\Temp\ipykernel_16760\1376782534.py:5: SyntaxWarning: invalid escape sequence '\d'
  df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].replace('[^\d.]', '', regex=True).str.extract('(\d+)').astype(float)

NameError: name 'df_sin_nulos' is not defined

In [2]:
import re

# Extrae el primer número válido (entero o decimal) de cada celda y lo convierte a float
df_sin_nulos['salary_numeric'] = df_sin_nulos['salary'].astype(str).apply(
    lambda x: float(re.search(r'\d+(?:\.\d+)?', x).group()) if re.search(r'\d+(?:\.\d+)?', x) else None
)

NameError: name 'df_sin_nulos' is not defined

In [5]:
df_sin_nulos['salary_numeric']

NameError: name 'df_sin_nulos' is not defined